package com.profi.jjd.lesson16.tasks.pupils;

public class PupilTask {
    public static void main(String[] args) {

        // Используя Stream API:

        // 1. Разделить учеников на две группы: мальчиков и девочек. Результат: Map<Pupil.Gender, ArrayList<Pupil>>

        // 2. Найти средний возраст учеников

        // 3. Найти самого младшего ученика

        // 4. Найти самого взрослого ученика

        // 5. Собрать учеников в группы по году рождения

        // 6. Оставить учеников с неповторяющимися именами, имена и дату рождения оставшихся вывести в консоль.
        // Например, [Иван, Александра, Ольга, Иван, Ольга] -> [Иван, Александра, Ольга]

        // 7. Отсортировать по полу, потом по дате рождения, потом по имени (в обратном порядке), собрать в список (List)

        // 8. Вывести в консоль всех учеников в возрасте от N до M лет

        // 9. Собрать в список всех учеников с именем=someName

        // 10. Собрать Map<Pupil.Gender, Integer>, где Pupil.Gender - пол, Integer - суммарный возраст учеников данного пола
    }
}